### Introduction
PANDAS - Panel Data System

- panda is use for data analysis

- its a library of python

we analyse two types of data with pandas:

1.series

2.DataFrame

In [2]:
import pandas as pd

### PANDAS Data Structure

Data Structure : It's a way of 
- to store data 
- to retrieve data
- to manipulate data
#### Python Data Structure:

- Series : one dimensional array , homogeneous(same data type),value mutable (can be changed), size can not be changed

- dataframe : two dimensional array, heterogenious(multiple data types), size mutable

#### Series Data Structure

In [3]:
#one dimensional array
# it has two components - data and index

#### How to create series objects

In [5]:
# 1. Creating empty series
import pandas as pd
obj = pd.Series()

C:\Users\13612\AppData\Local\Temp\ipykernel_12276\3337454502.py:3: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  obj = pd.Series()

In [10]:
#2. non empty series value can be list,tuples,dictionary,string
obj2 = pd.Series([5,10,15,20])

In [11]:
obj2

0     5
1    10
2    15
3    20
dtype: int64

In [12]:
obj3 = pd.Series(range(5))

In [13]:
obj3

0    0
1    1
2    2
3    3
4    4
dtype: int64

### Example:1 write a code to create a series object using the python sequence[4,6,8,10]

In [1]:
import pandas as pd

In [2]:
obj = pd.Series([4,6,8,10])

In [3]:
obj

0     4
1     6
2     8
3    10
dtype: int64

###  Example:2 write a code to create a series object using the python sequence(4,6,8,10)

In [4]:
obj1 = pd.Series((4,6,8,10))

In [5]:
obj1

0     4
1     6
2     8
3    10
dtype: int64

###  Example:2 write a code to create a series object using the individual value o,h,o

In [6]:
obj2 = pd.Series(['o','h','o'])

In [7]:
obj2

0    o
1    h
2    o
dtype: object

#### Example4: write a program to create a Series obj using string So Funny

In [11]:
obj3 = pd.Series('So Funny')

In [12]:
obj3

0    So Funny
dtype: object

#### Example 5: write a program to create a series object using three diffrent words I am laughing

In [14]:
obj4 = pd.Series(['I','am','laughing'])

In [15]:
obj4

0           I
1          am
2    laughing
dtype: object

## Create Series using numpy array

In [17]:
import numpy as np
import pandas as pd

In [20]:
nda = np.arange(3,13,3) # start , end, step value

In [21]:
nda

array([ 3,  6,  9, 12])

In [22]:
obj5 = pd.Series(nda)

In [23]:
obj5

0     3
1     6
2     9
3    12
dtype: int32

In [24]:
obj = pd.Series(np.arange(3,13,3.5))

In [25]:
obj

0     3.0
1     6.5
2    10.0
dtype: float64

#### Example6:Write a program to create an nd array that has 5 elements in the range 24 to 64

In [26]:
import pandas as pd
import numpy as np

In [27]:
obj1 = pd.Series(np.linspace(24,64,5))    ## start,end,no of elements start ,end value included in linspace function 
                                           ##in arnage function end value is excluded

In [28]:
obj1

0    24.0
1    34.0
2    44.0
3    54.0
4    64.0
dtype: float64

#### Example7: Write a program to create an nd array that is tiling a list of 3,5 

tile means - how many times we can repeat

In [32]:
obj2 = pd.Series(np.tile([3,5],2))  ## repeat 2 times

In [33]:
obj2

0    3
1    5
2    3
3    5
dtype: int32

## Making Series object using dictionary

In [34]:
obj1 = pd.Series({'Jan':31,'Feb':28,'Mar':31})

In [35]:
obj1  ## keys wil convert to index

Jan    31
Feb    28
Mar    31
dtype: int64

Example8: Write a program to create a Series object using a dictionary that stores the number of stutednts in each section  of class 12 in your school

In [36]:
obj2 = pd.Series({'A':50,'B':50,'C':52})

In [37]:
obj2

A    50
B    50
C    52
dtype: int64

## Specify Data as a Scaler value

In [38]:
## specify the index
obj = pd.Series(10,index=range(0,1))

In [39]:
obj

0    10
dtype: int64

In [40]:
obj1 = pd.Series(15,index=range(1,6,2))

In [41]:
obj1

1    15
3    15
5    15
dtype: int64

In [42]:
obj2 = pd.Series('yet to start', index =['ND','BD'])

In [43]:
obj2

ND    yet to start
BD    yet to start
dtype: object

Example 9: write a program to create a series object that tools the initial budget allocation of the 50000 each 
for the four quarters Q,Q2,Q3,Q4

In [44]:
obj = pd.Series(50000,index=['Q1','Q2','Q3','Q4'])

In [45]:
obj

Q1    50000
Q2    50000
Q3    50000
Q4    50000
dtype: int64

Example 10: Total number of medals to be won each 200 in the entire university games held every altrenate year.
Write a code to create a series object that stores this medals for games to be held in decade 2020 to 2029

In [46]:
obj3 = pd.Series(200, index =range(2020,2029,2))

In [47]:
obj3

2020    200
2022    200
2024    200
2026    200
2028    200
dtype: int64

## Series Attributes

In [56]:
import pandas as pd
import numpy as np

In [50]:
dates = [31,28,31,30]
months = ['Jan','Feb','March','April']

In [51]:
obj = pd.Series(data =dates, index=months)

In [52]:
obj

Jan      31
Feb      28
March    31
April    30
dtype: int64

In [53]:
##index attribute-return indexes
obj.index

Index(['Jan', 'Feb', 'March', 'April'], dtype='object')

In [54]:
## values attribute
obj.values

array([31, 28, 31, 30], dtype=int64)

In [55]:
##dtype attribute
obj1 =pd.Series([3.5,5,6.5,8])

In [57]:
obj2=pd.Series([6.5,np.NaN,2.34])

In [58]:
obj1.dtype

dtype('float64')

In [59]:
obj2.dtype

dtype('float64')

In [62]:
##item function
obj1.item

<bound method IndexOpsMixin.item of 0    3.5
1    5.0
2    6.5
3    8.0
dtype: float64>

In [63]:
##To retrive shape

In [65]:
obj1.shape

(4,)

In [67]:
## ending attribute:no of dimension
##size 
obj1.size

4

In [68]:
obj2.size

3

In [69]:
##diffrence between size and shape

In [70]:
##no of bytes :1 float =8 bytes
obj2.nbytes

24

In [71]:
##Checking emptyness
obj4 = pd.Series()

C:\Users\13612\AppData\Local\Temp\ipykernel_9808\3813769998.py:2: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  obj4 = pd.Series()

In [72]:
obj4.empty

True

### Series slicing

In [74]:
import pandas as pd
import numpy as np

In [75]:
obj1 =pd.Series([5,10,15,20])

In [76]:
obj1

0     5
1    10
2    15
3    20
dtype: int64

#### Accessing individual elements -through index

In [78]:
obj1[2]

15

In [79]:
obj[3]

30

#### Extracting slices : same as string/list

In [81]:
obj1[1:3]

1    10
2    15
dtype: int64

In [82]:
obj1[1:]

1    10
2    15
3    20
dtype: int64

In [83]:
obj1[:2]

0     5
1    10
dtype: int64

#### modifyting elements of series object

In [84]:
obj1

0     5
1    10
2    15
3    20
dtype: int64

In [85]:
obj1[2]=40

In [86]:
obj1

0     5
1    10
2    40
3    20
dtype: int64

In [87]:
obj1[3]=80

In [88]:
obj1

0     5
1    10
2    40
3    80
dtype: int64

In [90]:
obj1[1:3] =50

In [91]:
obj1

0     5
1    50
2    50
3    80
dtype: int64

#### Renaming indexes

In [92]:
obj1

0     5
1    50
2    50
3    80
dtype: int64

In [94]:
obj1.index=['A','B','C','D'] ##no shound be same

In [95]:
obj1

A     5
B    50
C    50
D    80
dtype: int64

#### Head() and Tail() Function

In [96]:
obj1.head(2) ## extract first elemnts-by default extarct 5 elements

A     5
B    50
dtype: int64

In [97]:
obj1.tail(2) ## extract last elements

C    50
D    80
dtype: int64

#### Vector operation of series object

In [98]:
obj1+2

A     7
B    52
C    52
D    82
dtype: int64

In [99]:
obj1*2

A     10
B    100
C    100
D    160
dtype: int64

#### Arithmetic on Series object

In [100]:
obj1 =pd.Series([5,10,15,20])
obj2 = pd.Series([2,3,4,5])
obj3 =pd.Series([3,6])

In [101]:
obj1

0     5
1    10
2    15
3    20
dtype: int64

In [102]:
obj2

0    2
1    3
2    4
3    5
dtype: int64

In [103]:
obj3

0    3
1    6
dtype: int64

In [104]:
## ADDITION, SUBSTRACTION,MULTIPLICATION,DIVISION - perform operation index to index

In [105]:
obj1+obj2

0     7
1    13
2    19
3    25
dtype: int64

In [106]:
obj2+obj3

0    5.0
1    9.0
2    NaN
3    NaN
dtype: float64

### Filtering Entries

In [107]:
info =pd.Series(data =[31,41,51])

In [108]:
info

0    31
1    41
2    51
dtype: int64

In [109]:
print(info>40)

0    False
1     True
2     True
dtype: bool

In [110]:
print(info[info>40])

1    41
2    51
dtype: int64

In [111]:
info>40

0    False
1     True
2     True
dtype: bool

In [112]:
info[info>40]

1    41
2    51
dtype: int64

### Sorting Series values

In [114]:
obj1.sort_values

<bound method Series.sort_values of 0     5
1    10
2    15
3    20
dtype: int64>

In [116]:
obj1.sort_values(ascending =False)

3    20
2    15
1    10
0     5
dtype: int64

In [117]:
## to sort index
obj.sort_index

<bound method Series.sort_index of Jan      31
Feb      28
March    31
April    30
dtype: int64>

In [119]:
obj1.sort_values

<bound method Series.sort_values of 0     5
1    10
2    15
3    20
dtype: int64>

In [120]:
##difrrence between numpy arrays and Series
#To perform vector operation even index number are not the same
#we can generate index in series

## DATAFRAME

### Creating DataFrame object

In [121]:
#stores data in two dimensional way - row and column

In [123]:
import pandas as pd
import numpy as np

#### - Using 2D Dictionary

In [131]:
dict1 ={"student":["Ayman","Sarah","Sumi"],"marks":[80,90,100],"sports":["cricket","Football","Hockey"]}  ##2d dict

In [132]:
dict1

{'student': ['Ayman', 'Sarah', 'Sumi'],
 'marks': [80, 90, 100],
 'sports': ['cricket', 'Football', 'Hockey']}

In [133]:
df = pd.DataFrame(dict1)  ## all array must be in the same length to create data frame

In [134]:
df

  student  marks    sports
0   Ayman     80   cricket
1   Sarah     90  Football
2    Sumi    100    Hockey

In [135]:
## to create index-row
pd.DataFrame(dict1,index=['I','II','III'])

    student  marks    sports
I     Ayman     80   cricket
II    Sarah     90  Football
III    Sumi    100    Hockey

#### Example :Given a dictionary that stores the section name list as values for section key and contribution amount as countrys key

In [139]:
dict1 ={"Section":["A","B","C","D"], "Contribution":[67000,5600,5000,5200]}

In [140]:
df1 = pd.DataFrame(dict1)

In [141]:
df1

  Section  Contribution
0       A         67000
1       B          5600
2       C          5000
3       D          5200

#### Example: Creating a DataFrame form 2D dictionary having values as dictionary object

In [143]:
dict2 = {"Sales":{"name":"ayman","age":24,"sex":"male"},"marketing":{"name":"sarah","age":22,"sex":"female"}}

In [145]:
df = pd.DataFrame(dict2)

In [146]:
df  ##rows index will be defined form the value

      Sales marketing
name  ayman     sarah
age      24        22
sex    male    female

In [147]:
dict3 = {"Sales":{"name":"ayman","age":24,"sex":"male"},"marketing":{"name":"sarah","age":22}} # if one value missing (NAN)

In [150]:
df2 = pd.DataFrame(dict3)

In [151]:
df2

      Sales marketing
name  ayman     sarah
age      24        22
sex    male       NaN

In [152]:
dict4 = {"Sales":{"name":"ayman","age":24,"sex":"male"},"marketing":{"name":"sarah","age":22,"Salary":"30000"}}

In [155]:
df3 = pd.DataFrame(dict4)  ##with diffrent values # it will create diffrent rows

In [154]:
df3

        Sales marketing
name    ayman     sarah
age        24        22
sex      male       NaN
Salary    NaN     30000

## Creating DataFrame object from a list of Dictionary

In [157]:
import pandas as pd
import numpy as np

In [166]:
dict5 = {'roll':101,'name':'Sumi','Marks':95}

In [167]:
dict6 = {'roll':102,'name':'Marufa','Marks':98}

In [168]:
dict7 = {'roll':103,'name':'hadi','Marks':100}

In [170]:
list1 =[dict5, dict6, dict7]

In [171]:
df5 = pd.DataFrame(list1)

In [172]:
df5

   roll    name  Marks
0   101    Sumi     95
1   102  Marufa     98
2   103    hadi    100

In [173]:
#if we want to give index

In [174]:
df5 = pd.DataFrame(list1, index=["SecA","SecB","SecC"])

In [175]:
df5

      roll    name  Marks
SecA   101    Sumi     95
SecB   102  Marufa     98
SecC   103    hadi    100

#### Passing a 2D list to create DataFrame

In [177]:
list2 = [[10,20,30],[40,50,60],[70,80,90]]

In [178]:
df6 = pd.DataFrame(list2)

In [179]:
df6

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [184]:
## with row and column name
df7 = pd.DataFrame(list2,index=['row1','row2','row3'], columns = ['col1','col2','col3'])

In [185]:
df7

      col1  col2  col3
row1    10    20    30
row2    40    50    60
row3    70    80    90

#### Creating a DataFrame object from 2D ndarray

In [186]:
arr1 = np.array([[10,20,30],[40,50,60]])

In [187]:
df8 = pd.DataFrame(arr1)

In [188]:
df8

    0   1   2
0  10  20  30
1  40  50  60

In [190]:
##with index and column
df9 = pd.DataFrame(arr1, index=['r1','r2'],columns =['c1','c2','c3'])

In [191]:
df9

    c1  c2  c3
r1  10  20  30
r2  40  50  60

In [193]:
## when values are diffrent
list3 = [[10,20,30],[40,50],[70,80,90,90]]

In [194]:
df10 = pd.DataFrame(list3)

In [195]:
df10

    0   1     2     3
0  10  20  30.0   NaN
1  40  50   NaN   NaN
2  70  80  90.0  90.0

#### Creating a DataFrame from 2D dictionary with values of series object

In [197]:
staff = pd.Series([20,36,44])
salary = pd.Series([10000,15000,20000])

In [198]:
school ={'people':staff, 'amount':salary}

In [200]:
df11 = pd.DataFrame(school)

In [201]:
df11

   people  amount
0      20   10000
1      36   15000
2      44   20000

#### Creating a DataFrame object from another DataFrame object

In [202]:
df12 = pd.DataFrame([[10,20,30],[40,50,60]])

In [203]:
df13 =pd.DataFrame(df12)

In [204]:
df12

    0   1   2
0  10  20  30
1  40  50  60

In [205]:
df13

    0   1   2
0  10  20  30
1  40  50  60

### DataFrame Attributes/ Function

In [206]:
import pandas as pd

In [207]:
dict1 = {"Sales":{"name":"ayman","age":24,"sex":"male"},"marketing":{"name":"sarah","age":22,"sex":"female"}}

In [208]:
dfn = pd.DataFrame(dict1)

In [209]:
dfn

      Sales marketing
name  ayman     sarah
age      24        22
sex    male    female

In [210]:
## index : will return index/row
dfn.index

Index(['name', 'age', 'sex'], dtype='object')

In [211]:
## columns : to return col
dfn.columns

Index(['Sales', 'marketing'], dtype='object')

In [212]:
##axes : show both row and column
dfn.axes

[Index(['name', 'age', 'sex'], dtype='object'),
 Index(['Sales', 'marketing'], dtype='object')]

In [213]:
## datatypes
dfn.dtypes  ##mix of string and int

Sales        object
marketing    object
dtype: object

In [214]:
## size -return total elements of the object
dfn.size

6

In [215]:
##shape (row,column)
dfn.shape

(3, 2)

In [216]:
##ndim : no of dimension
dfn.ndim

2

In [217]:
## empty - check empty or nor
dfn.empty

False

In [218]:
##length- no of rows
len(dfn)

3

In [223]:
##count -total values
dfn.count(0)

Sales        3
marketing    3
dtype: int64

In [222]:
dfn.count(axis='index')

Sales        3
marketing    3
dtype: int64

In [224]:
dfn.count(1) ## to count column

name    2
age     2
sex     2
dtype: int64

In [227]:
dfn.count(axis ='columns')

name    2
age     2
sex     2
dtype: int64

In [228]:
## Transposing a dataframe : inverse the row to column and column to row
dfn.T

            name age     sex
Sales      ayman  24    male
marketing  sarah  22  female

In [229]:
##numpy representation of DataFrame
dfn.values

array([['ayman', 'sarah'],
       [24, 22],
       ['male', 'female']], dtype=object)

### DataFrame Object:loc and iloc Function

In [233]:
dict0 = {"population":{"A":15000,"B":13000,"C":14000},"Hospital":{"A":1000,"B":500,"C":700},"Schools":{"A":500,"B":900,"C":800}}

In [234]:
dict0

{'population': {'A': 15000, 'B': 13000, 'C': 14000},
 'Hospital': {'A': 1000, 'B': 500, 'C': 700},
 'Schools': {'A': 500, 'B': 900, 'C': 800}}

In [237]:
df12 = pd.DataFrame(dict0)

In [238]:
df12

   population  Hospital  Schools
A       15000      1000      500
B       13000       500      900
C       14000       700      800

#### How to selecting /accessing column

In [240]:
df12['population']

A    15000
B    13000
C    14000
Name: population, dtype: int64

In [241]:
## second way
df12['Schools']

A    500
B    900
C    800
Name: Schools, dtype: int64

In [243]:
df12.Schools

A    500
B    900
C    800
Name: Schools, dtype: int64

#### to access multiple column

In [244]:
df12[['population','Hospital']]

   population  Hospital
A       15000      1000
B       13000       500
C       14000       700

In [245]:
## selcting subset row /column

In [246]:
##syntax:dataframeobj.loc[start row :end row ,start col:end col]

In [248]:
df12.loc['A',:] ##extract all data of A

population    15000
Hospital       1000
Schools         500
Name: A, dtype: int64

In [249]:
df12.loc['B':'C',:]

   population  Hospital  Schools
B       13000       500      900
C       14000       700      800

In [250]:
df12.loc['A':'C',:]

   population  Hospital  Schools
A       15000      1000      500
B       13000       500      900
C       14000       700      800

In [251]:
df12.loc[:,'Hospital':'Schools'] ##to access column

   Hospital  Schools
A      1000      500
B       500      900
C       700      800

In [252]:
## to access row and column both
# : indicate range
df12.loc['B':'C','Hospital':'Schools']

   Hospital  Schools
B       500      900
C       700      800

#### iloc function

In [253]:
## use when we don't know the name of row and column
## syntax dataframobject.iloc[start r index : end r index , start col index : end col index]
## end index data is excluded in this case

In [255]:
df12.iloc[0:2,1:3]

   Hospital  Schools
A      1000      500
B       500      900

In [256]:
df12.iloc[2:4,0:2]

   population  Hospital
C       14000       700

## Adding,Deleting,Updating,Renaming Rows and columns

In [257]:
# Accessing individual element of dataframe object

In [259]:
df12.population['A']

15000

In [260]:
df12.Hospital['B']

500

In [261]:
# at

In [262]:
df12.at['B','Hospital']

500

In [265]:
df12.iat[1,2] ## row and column index

900

#### adding, modifying a column

In [266]:
df12['Density']=5125 #add new column with same value

In [267]:
df12

   population  Hospital  Schools  Density
A       15000      1000      500     5125
B       13000       500      900     5125
C       14000       700      800     5125

In [269]:
df12['Density']=[1500,1600,1700] ## new column with diffrent values

In [270]:
df12

   population  Hospital  Schools  Density
A       15000      1000      500     1500
B       13000       500      900     1600
C       14000       700      800     1700

In [271]:
df12.loc[:,'Race'] =["Asian","American",'European'] ##using loc function

In [272]:
df12

   population  Hospital  Schools  Density      Race
A       15000      1000      500     1500     Asian
B       13000       500      900     1600  American
C       14000       700      800     1700  European

#### Adding modifying a row

In [273]:
df12.at['D',:]=1200  ## new column with same value

df12

In [278]:
df12.at['D',:]=[1200,1300,1400,1500,1600]

In [279]:
df12

   population  Hospital  Schools  Density      Race
A     15000.0    1000.0    500.0   1500.0     Asian
B     13000.0     500.0    900.0   1600.0  American
C     14000.0     700.0    800.0   1700.0  European
D      1200.0    1300.0   1400.0   1500.0      1600

#### Modifying a cell

In [281]:
df12.population['C'] =23000

C:\Users\13612\AppData\Local\Temp\ipykernel_9808\1057059699.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df12.population['C'] =23000

In [282]:
df12

   population  Hospital  Schools  Density      Race
A     15000.0    1000.0    500.0   1500.0     Asian
B     13000.0     500.0    900.0   1600.0  American
C     23000.0     700.0    800.0   1700.0  European
D      1200.0    1300.0   1400.0   1500.0      1600

#### Deleting /Renaming column or row

In [283]:
del df12['Density']

In [284]:
df12

   population  Hospital  Schools      Race
A     15000.0    1000.0    500.0     Asian
B     13000.0     500.0    900.0  American
C     23000.0     700.0    800.0  European
D      1200.0    1300.0   1400.0      1600

In [285]:
## using drop function
df12.drop(['Race','Hospital'], axis=1) ## axis =1 indate column

   population  Schools
A     15000.0    500.0
B     13000.0    900.0
C     23000.0    800.0
D      1200.0   1400.0

In [290]:
## to delete row
df12

   population  Hospital  Schools      Race
A     15000.0    1000.0    500.0     Asian
B     13000.0     500.0    900.0  American
C     23000.0     700.0    800.0  European
D      1200.0    1300.0   1400.0      1600

In [297]:
## Rename a row and column
df12.rename(index={"A":"G","B":"H"})

   population  Hospital  Schools      Race
G     15000.0    1000.0    500.0     Asian
H     13000.0     500.0    900.0  American
C     23000.0     700.0    800.0  European
D      1200.0    1300.0   1400.0      1600

In [298]:
## to make change permanently
df12.rename(index={"A":"G","B":"H"},inplace='True')

In [299]:
df12

   population  Hospital  Schools      Race
G     15000.0    1000.0    500.0     Asian
H     13000.0     500.0    900.0  American
C     23000.0     700.0    800.0  European
D      1200.0    1300.0   1400.0      1600

In [304]:
# to rename column
df12.rename(columns = {'population':'popu'})

      popu  Hospital  Schools      Race
G  15000.0    1000.0    500.0     Asian
H  13000.0     500.0    900.0  American
C  23000.0     700.0    800.0  European
D   1200.0    1300.0   1400.0      1600

In [306]:
df12.rename(index = {"G":"A"})

   population  Hospital  Schools      Race
A     15000.0    1000.0    500.0     Asian
H     13000.0     500.0    900.0  American
C     23000.0     700.0    800.0  European
D      1200.0    1300.0   1400.0      1600

In [307]:
df12

   population  Hospital  Schools      Race
G     15000.0    1000.0    500.0     Asian
H     13000.0     500.0    900.0  American
C     23000.0     700.0    800.0  European
D      1200.0    1300.0   1400.0      1600

In [308]:
##Boolean concept
## 0=False , 1 =True

## iterrows an iteritems Function

When we need to go through each element of a DataFrame ,we can do it using two Functions

iterrows() : iterate over row wise

iteritems() : iterates over column wise

In [309]:
sales ={'year_01':{'Qtr1':5000,'Qtr2':6000, 'Qtr3':5500,'Qtr4': 6000},
        'year_02':{'Qtr1':5100,'Qtr2':6200, 'Qtr3':5800,'Qtr4': 5400},
       'year_03':{'Qtr1':5200,'Qtr2':6300, 'Qtr3':5600,'Qtr4': 6300},
       'year_04':{'Qtr1':4500,'Qtr2':5600, 'Qtr3':6000,'Qtr4': 5900}}

In [310]:
df_sales =pd.DataFrame(sales)

In [311]:
df_sales

      year_01  year_02  year_03  year_04
Qtr1     5000     5100     5200     4500
Qtr2     6000     6200     6300     5600
Qtr3     5500     5800     5600     6000
Qtr4     6000     5400     6300     5900

In [314]:
for (a,b) in df_sales.iterrows():
    print('Row Index : ',a,'\nValue =\n',b)

Row Index :  Qtr1
Value =
 year_01    5000
year_02    5100
year_03    5200
year_04    4500
Name: Qtr1, dtype: int64
Row Index :  Qtr2
Value =
 year_01    6000
year_02    6200
year_03    6300
year_04    5600
Name: Qtr2, dtype: int64
Row Index :  Qtr3
Value =
 year_01    5500
year_02    5800
year_03    5600
year_04    6000
Name: Qtr3, dtype: int64
Row Index :  Qtr4
Value =
 year_01    6000
year_02    5400
year_03    6300
year_04    5900
Name: Qtr4, dtype: int64

In [316]:
for (a,b) in df_sales.iteritems():
    print('column Index : ',a,'\nValue =\n')
    for i in b:
        print(i)

column Index :  year_01
Value =

5000
6000
5500
6000
column Index :  year_02
Value =

5100
6200
5800
5400
column Index :  year_03
Value =

5200
6300
5600
6300
column Index :  year_04
Value =

4500
5600
6000
5900

In [317]:
## write a program to print the Dataframe df, one row at a time.

In [318]:
data ={'Name':['Ram','Sam','Jadu','Madu'],'Marks':[80,90,60,95]}

In [319]:
dfd = pd.DataFrame(data)

In [320]:
dfd

   Name  Marks
0   Ram     80
1   Sam     90
2  Jadu     60
3  Madu     95

In [323]:
print("Name\tMarks")
print("______________")
for i,j in dfd.iterrows():
    print(j)
print("___________________")

Name	Marks
______________
Name     Ram
Marks     80
Name: 0, dtype: object
Name     Sam
Marks     90
Name: 1, dtype: object
Name     Jadu
Marks      60
Name: 2, dtype: object
Name     Madu
Marks      95
Name: 3, dtype: object
___________________

In [324]:
## write a program to print DataFrame ,one column at a time

In [325]:
dfd

   Name  Marks
0   Ram     80
1   Sam     90
2  Jadu     60
3  Madu     95

In [326]:
for i,j in dfd.iteritems():
    print(j)

0     Ram
1     Sam
2    Jadu
3    Madu
Name: Name, dtype: object
0    80
1    90
2    60
3    95
Name: Marks, dtype: int64

In [327]:
## we can also print individual column for extracted row using iterrows by using rowSeries

In [328]:
dfd

   Name  Marks
0   Ram     80
1   Sam     90
2  Jadu     60
3  Madu     95

In [338]:
d1 ={'Name':['Ram','Sam','Jadu','Madu'],'Marks':[80,90,60,95]}

In [339]:
df =pd.DataFrame(d1)

In [340]:
df

   Name  Marks
0   Ram     80
1   Sam     90
2  Jadu     60
3  Madu     95

In [341]:
for i,j in df.iterrows(): ##To access specific column
    print(j['Marks'])

80
90
60
95

## Binary operation in DataFrame

In the binary operation two dataframes are alligned on the basis of their row and column indes and for the matching row, the column index the given operation is performed and for non matcing NaN is stored

In [1]:
import pandas as pd

In [2]:
d1 = {"A":[1,4,7],"B":[2,5,8],"C":[3,6,9]}

In [3]:
df = pd.DataFrame(d1)

In [4]:
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [5]:
d2 = {"A":[10,40,70],"B":[20,50,80],"C":[30,60,90]}

In [6]:
df1 = pd.DataFrame(d2)

In [7]:
df1

    A   B   C
0  10  20  30
1  40  50  60
2  70  80  90

In [34]:
d3 = {"A":[100,400],"B":[200,500],"C":[300,600]}

In [35]:
df2 =pd.DataFrame(d3)

In [36]:
df2

     A    B    C
0  100  200  300
1  400  500  600

In [17]:
d4 = {"A":[1000,4000,7000],"B":[2000,5000,8000]}

In [18]:
df3 =pd.DataFrame(d4)

In [19]:
df3

      A     B
0  1000  2000
1  4000  5000
2  7000  8000

In [14]:
## To add 
df+df1

    A   B   C
0  11  22  33
1  44  55  66
2  77  88  99

In [15]:
##OR
df.add(df1)

    A   B   C
0  11  22  33
1  44  55  66
2  77  88  99

In [16]:
##OR
df.radd(df1)

    A   B   C
0  11  22  33
1  44  55  66
2  77  88  99

In [20]:
df-df2

     A    B    C
0  -99 -198 -297
1 -396 -495 -594
2 -693 -792 -891

In [21]:
## To substract
df1-df

    A   B   C
0   9  18  27
1  36  45  54
2  63  72  81

In [22]:
df.sub(df2)

     A    B    C
0  -99 -198 -297
1 -396 -495 -594
2 -693 -792 -891

In [24]:
df.rsub(df1)  #rsub means reversing here it will be df1-df

    A   B   C
0   9  18  27
1  36  45  54
2  63  72  81

In [25]:
## Multiplication
df1*df

     A    B    C
0   10   40   90
1  160  250  360
2  490  640  810

In [26]:
df1.mul(df2)

       A      B      C
0   1000   4000   9000
1  16000  25000  36000
2  49000  64000  81000

In [28]:
df1.rmul(df)

     A    B    C
0   10   40   90
1  160  250  360
2  490  640  810

In [29]:
## Substraction
df/df1

     A    B    C
0  0.1  0.1  0.1
1  0.1  0.1  0.1
2  0.1  0.1  0.1

In [30]:
df.div(df1)

     A    B    C
0  0.1  0.1  0.1
1  0.1  0.1  0.1
2  0.1  0.1  0.1

In [31]:
df.rdiv(df1)  ## reverse division

      A     B     C
0  10.0  10.0  10.0
1  10.0  10.0  10.0
2  10.0  10.0  10.0

In [32]:
## to use rdiv/radd/rsub/rmul there will be no change in result in addition and multiplication with other method.
##division and substraction will have diffrent result

In [37]:
df+df2  ## NAN is stronger than integer , only float can store NAN thats why all value converted to float

       A      B      C
0  101.0  202.0  303.0
1  404.0  505.0  606.0
2    NaN    NaN    NaN

In [38]:
##if value does not match NAN will store

#### Example: write a program to calculate total points earned by both the team in each round

In [40]:
data1 ={"P1":{"1":700,"2":975,"3":970,"4":900}, "P2":{"1":490,"2":460,"3":570,"4":590}}

In [41]:
data2 ={"P1":{"1":1100,"2":1275,"3":1270,"4":1400}, "P2":{"1":1400,"2":1260,"3":1500,"4":1190}}

In [42]:
df1 =pd.DataFrame(data1)

In [43]:
df1

    P1   P2
1  700  490
2  975  460
3  970  570
4  900  590

In [44]:
df2 =pd.DataFrame(data2)

In [45]:
df2

     P1    P2
1  1100  1400
2  1275  1260
3  1270  1500
4  1400  1190

In [49]:
print("Team 1's perfomance")
print(df1)

print("Team 2's perfomance")
print(df2)

print("Join perfomance")
print(df1+df2)

Team 1's perfomance
    P1   P2
1  700  490
2  975  460
3  970  570
4  900  590
Team 2's perfomance
     P1    P2
1  1100  1400
2  1275  1260
3  1270  1500
4  1400  1190
Join perfomance
     P1    P2
1  1800  1890
2  2250  1720
3  2240  2070
4  2300  1780